[
  {
    "title": "Attorney General Liz Murrill sues Roblox",
    "date": "2025-08-14",
    "summary": "Louisiana Attorney General Liz Murrill announced a lawsuit against Roblox, accusing the platform of facilitating the distribution of child sexual abuse material and enabling sexual exploitation of minors. She emphasized that the company has failed to take sufficient action to protect children, despite being aware of these issues. Murrill's office is seeking accountability and legal remedies to address these concerns.",
	"link-x": "https://x.com/AGLizMurrill/status/1956081394083409932",
    "link": "https://aglizmurrill.com/Article/322",
    "tags": ["Lawsuit" , "Drama" , "Child Safety Issue"]
  },
  {
    "title": "Family Sues Roblox, Discord After Child Raped By Predatory User",
    "date": "2025-07-23",
    "summary": "Most Parents are aware of concerns about social media and children, but often perceive games marketed to children like Roblox as safe. A lawsuit filed in California on July 17, 2025 alleges that Roblox misrepresents itself as safe while allowing a platform that makes children easy prey for pedophiles.",
	"link" : "https://www.forbes.com/sites/alisonescalante/2025/07/23/family-sues-roblox-discord-after-child-raped-by-predatory-user",
    "tags": ["Lawsuit", "Creator Issues"]                             
  },
  {
    "title": "A pedophile used Roblox to groom, abduct and sexually assault a 15-year-old girl, a full 18 months after the community had outed him as a predator",
    "date": "2024-08-07",
    "summary": "A new report from Bloomberg Businessweek covers the investigation and arrest of a pedophile who used the Roblox gaming platform to groom his victim, before abducting and sexually assaulting her multiple times. The man assumed various identities on Roblox but was best-known as the creator of a profitable Sonic the Hedgehog fan game on the platform, a position that gave him considerable clout within the Roblox community, and one which he used to prey upon its young users.",
	"link" : "https://www.pcgamer.com/software/platforms/a-pedophile-used-roblox-to-groom-abduct-and-sexually-assault-a-15-year-old-girl-a-full-18-months-after-the-community-had-outed-him-as-a-predator",
    "tags": ["Child Safety Issue"]                             
  },
  {
    "title": "Family sues Roblox, Discord over kidnapping of 10-year-old girl",
    "date": "2025-08-05",
    "summary": "(CN) — In April, police found a missing 10-year-old girl and her pet bird with 27-year-old Matthew Naval, in a strip mall more than 250 miles from her home in Kern County, after the two reportedly met and communicated online through Roblox. Now, her family says in a complaint filed Tuesday in San Mateo Superior Court that the online gaming platform is a 'digital and real-life nightmare' for children.",
	"link" : "https://www.courthousenews.com/family-sues-roblox-discord-over-kidnapping-of-10-year-old-girl",
    "tags": ["Child Safety Issue", "Lawsuit"]                             
  },
  {
  "title": "Roblox Bans YouTuber RealSchlep After Exposing Predators",
  "date": "2025-08-15",
  "summary": "YouTuber RealSchlep, known for exposing alleged child predators on Roblox, has been banned from the platform and received a cease-and-desist letter. Roblox claims he violated safety protocols by staging chats and interfering with moderation, while Schlep argues his actions led to arrests and protected children. The case has sparked debate about online safety and community-led investigations.",
  "link-x": "https://x.com/RealSchlep/status/1954255952997478537",
  "link": "https://m.economictimes.com/news/new-updates/roblox-suspends-youtuber-realschleps-account-after-viral-predator-catch-operation-says-he-is-being-punished-for-it/articleshow/123261209.cms",
  "tags": ["Creator", "Cease-and-Desist", "Online Safety"]
  },
  {
    "title": "ROBLOX IS SCREWED – Congressman Ro Khanna Involved",
    "date": "2025-08-13",
    "summary": "DramaAlert reports that Congressman Ro Khanna has reached out to Predator Buster RealSchlep regarding Roblox's child safety issues.",
    "link-x": "https://x.com/DramaAlert/status/1955675289381708070",
    "tags": ["Drama"]
  }
]

